# Import sqlalchemy and pandas

In [143]:
from sqlalchemy import create_engine, text

In [144]:
import pandas as pd

# Create a connection string.

In [145]:
database_name = 'scooters'    # Fill this in with your lahman database name ##scooters

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

# Create an engine

In [146]:
engine = create_engine(connection_string)

In [147]:
engine

Engine(postgresql://postgres:***@localhost:5432/scooters)

# Import pandas

# query connect

In [148]:
query = '''
SELECT *
FROM trips
LIMIT 100;
'''

with engine.connect() as connection:
    scooters100 = pd.read_sql(text(query), con = connection)
    
scooters100

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.000000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.715600,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.000000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.000000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.000000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,2019-05-01 00:35:56.717,Bird,BRD2302,PoweredISXDY,17.000000,8202.10000,2019-05-01,00:18:55.406666,2019-05-01,00:36:04.586666,36.16730,-86.78300,36.15440,-86.79890,"[(36.166937, -86.782786), (36.165893, -86.7818...",2019-05-02 05:30:28.523
96,2019-05-01 00:37:02.933,Lyft,LFT59,Powered980721,15.817283,11404.19984,2019-05-01,00:21:13.733333,2019-05-01,00:37:02.770000,36.15840,-86.77693,36.16908,-86.76753,"[(36.1584, -86.77693), (36.15845, -86.7769), (...",2019-05-02 07:20:34.490
97,2019-05-01 00:37:39.827,Lyft,LFT61,Powered594191,16.260350,11033.46492,2019-05-01,00:21:24.126666,2019-05-01,00:37:39.750000,36.15843,-86.77686,36.16911,-86.76755,"[(36.15843, -86.77686), (36.15838, -86.7769), ...",2019-05-02 07:20:34.553
98,2019-05-01 00:37:41.263,Lyft,LFT62,Powered251145,8.953833,633.20212,2019-05-01,00:28:43.906666,2019-05-01,00:37:41.136666,36.16255,-86.77552,36.16285,-86.77590,"[(36.16255, -86.77552), (36.16259, -86.77561),...",2019-05-02 07:20:34.590
99,2019-05-01 00:39:22.380,Lyft,LFT63,Powered915923,12.783283,13989.50176,2019-05-01,00:26:35.293333,2019-05-01,00:39:22.290000,36.14112,-86.79115,36.14984,-86.76578,"[(36.14112, -86.79115), (36.1412, -86.79111), ...",2019-05-02 07:20:34.620

In [149]:
scooters100.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   pubtimestamp    100 non-null    datetime64[ns]
 1   companyname     100 non-null    object
 2   triprecordnum   100 non-null    object
 3   sumdid          100 non-null    object
 4   tripduration    100 non-null    float64
 5   tripdistance    100 non-null    float64
 6   startdate       100 non-null    object
 7   starttime       100 non-null    object
 8   enddate         100 non-null    object
 9   endtime         100 non-null    object
 10  startlatitude   100 non-null    float64
 11  startlongitude  100 non-null    float64
 12  endlatitude     100 non-null    float64
 13  endlongitude    100 non-null    float64
 14  triproute       100 non-null    object
 15  create_dt       100 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(6), object(8)
memory usage: 12.6+ KB

# Are there any Null values?

In [150]:
#use .isna() with .any() to check for null values
scooters100.isna().any()

pubtimestamp      False
companyname       False
triprecordnum     False
sumdid            False
tripduration      False
tripdistance      False
startdate         False
starttime         False
enddate           False
endtime           False
startlatitude     False
startlongitude    False
endlatitude       False
endlongitude      False
triproute         False
create_dt         False
dtype: bool

# Read in Adell's csv's

In [151]:
#read in bird data from scooter table.
bird = pd.read_csv("../data/birddf.csv")
bird.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12251590 entries, 0 to 12251589
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 841.3+ MB

In [152]:
#read in bolt data from scooter table.
bolt = pd.read_csv("../data/boltdf.csv")
bolt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3477198 entries, 0 to 3477197
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 238.8+ MB

In [153]:
#read in gotcha data from scooter table.
gotcha = pd.read_csv("../data/gotchadf.csv")
gotcha.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4679280 entries, 0 to 4679279
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 321.3+ MB

In [154]:
#read in jump data from scooter table.
jump = pd.read_csv("../data/jumpdf.csv")
jump.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21835098 entries, 0 to 21835097
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 1.5+ GB

In [155]:
#read in lime data from scooter table.
lime = pd.read_csv("../data/limedf.csv")
lime.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16524261 entries, 0 to 16524260
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 1.1+ GB

In [156]:
#read in lyft data from scooter table.
lyft = pd.read_csv("../data/lyftdf.csv")
lyft.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9087043 entries, 0 to 9087042
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 624.0+ MB

In [157]:
#read in spin data from scooter table.
spin = pd.read_csv("../data/spindf.csv")
spin.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5559573 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 381.7+ MB

In [158]:
#read in all data from trips table.
trips_df = pd.read_csv("../data/tripsdf.csv")
trips_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 565522 entries, 0 to 565521
Data columns (total 16 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   pubtimestamp    565522 non-null  object
 1   companyname     565522 non-null  object
 2   triprecordnum   565522 non-null  object
 3   sumdid          565522 non-null  object
 4   tripduration    565522 non-null  float64
 5   tripdistance    565522 non-null  float64
 6   startdate       565522 non-null  object
 7   starttime       565522 non-null  object
 8   enddate         565522 non-null  object
 9   endtime         565522 non-null  object
 10  startlatitude   565522 non-null  float64
 11  startlongitude  565522 non-null  float64
 12  endlatitude     565522 non-null  float64
 13  endlongitude    565522 non-null  float64
 14  triproute       565522 non-null  object
 15  create_dt       565522 non-null  object
dtypes: float64(6), object(10)
memory usage: 69.0+ MB

In [159]:
trips_df.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

# Concat tables into one df.

In [160]:
csvlist = [bird, bolt, gotcha, jump, lime, lyft, spin]
scooters_df = pd.concat(csvlist)

In [161]:
scooters_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  object
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: float64(4), object(5)
memory usage: 5.5+ GB

# Null Values?

In [162]:
#checking for null values in scooters_df
scooters_df.isnull().any()

pubdatetime    False
latitude       False
longitude      False
sumdid         False
sumdtype       False
chargelevel     True
sumdgroup      False
costpermin     False
companyname    False
dtype: bool

In [163]:
#count of null values
scooters_df.isnull().sum().sum()

770

In [164]:
#checking for null values in trips
trips_df.isnull().any()

pubtimestamp      False
companyname       False
triprecordnum     False
sumdid            False
tripduration      False
tripdistance      False
startdate         False
starttime         False
enddate           False
endtime           False
startlatitude     False
startlongitude    False
endlatitude       False
endlongitude      False
triproute         False
create_dt         False
dtype: bool

In [165]:
scooters_df.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

# Convert to datetime format

In [166]:
#convert pubdatetime to datetime format
scooters_df['pubdatetime'] = pd.to_datetime(scooters_df['pubdatetime'], format = 'mixed', dayfirst = False)

In [167]:
scooters_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  datetime64[ns]
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 5.5+ GB

In [168]:
#convert pubtimestamp to datetime format
trips_df['pubtimestamp'] = pd.to_datetime(trips_df['pubtimestamp'], format = 'mixed', dayfirst = False)

# Date range?

In [169]:
#min and max date scooters_df
print(scooters_df['pubdatetime'].min())
print(scooters_df['pubdatetime'].max())

2019-05-01 00:01:41.247000
2019-07-31 23:59:57

In [170]:
#min and max date trips_df
print(trips_df['pubtimestamp'].min())
print(trips_df['pubtimestamp'].max())

2019-05-01 00:00:55.423000
2019-08-01 07:04:00

Seems odd that the trips start before and end later than the time in scooters_df

Time is represented using 24 hour values.

# What values are represented in sumdgroup column?

In [171]:
scooters_df.sumdgroup.unique()

array(['scooter', 'Scooter', 'bicycle'], dtype=object)

In [172]:
scooters_df.value_counts(subset='sumdgroup')

sumdgroup
scooter    59671463
Scooter    13716051
bicycle       26529
Name: count, dtype: int64

the bicycles are not of interest to the project.

# What are the minimum and maximum values for all the latitude and longitude columns? Do these values make sense?

In [173]:
print('scooters_df latitude range')
print(scooters_df['latitude'].min())
print(scooters_df['latitude'].max())

scooters_df latitude range
0.0
3609874.116666

In [174]:
print('scooters_df longitude range')
print(scooters_df['longitude'].min())
print(scooters_df['longitude'].max())

scooters_df longitude range
-97.443879
0.0

In [175]:
print(trips_df['startlatitude'].min())
print(trips_df['startlatitude'].max())
print("")
print(trips_df['endlatitude'].min())
print(trips_df['endlatitude'].max())

35.8532
36.300029

-36.850405
51.045409

In [176]:
print(trips_df['startlongitude'].min())
print(trips_df['startlongitude'].max())
print("")
print(trips_df['endlongitude'].min())
print(trips_df['endlongitude'].max())

-86.918008
-86.3662

-122.673729
174.764886

In [177]:
#Min and Max trip distance
print(trips_df['tripdistance'].min())
print(trips_df['tripdistance'].max())

-20324803.8
31884482.6476

In [178]:
trips_df.query('`tripdistance` ==31884482.6476')

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
447799,2019-07-05 01:18:52,Gotcha,GOT9,Powered2460,9.0,3.188448e+07,2019-07-05,01:18:56,2019-07-05,01:27:56,36.16338,-86.780142,36.16628,-86.778127,"[('0', '0'), ('36.16628', '-86.77813')]",2019-07-06 07:13:12.210

# Company names

In [179]:
print(scooters_df.companyname.unique())
print(trips_df.companyname.unique())

['Bird' 'Bolt' 'Gotcha' 'Jump' 'Lime' 'Lyft' 'Spin']
['Bird' 'Lyft' 'Lime' 'Bolt Mobility' 'SPIN' 'Gotcha' 'JUMP']

The trips table has Bolt Mobility instead of just Bolt in the scooters table.

# Q1 During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [180]:
scooters_df.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird

In [181]:
trips_df.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [182]:
company_scooters = scooters_df[['companyname','sumdid']].groupby(['companyname'])['sumdid'].nunique().reset_index(name='count').sort_values(['count'])

In [183]:
company_scooters

  companyname  count
2      Gotcha    224
1        Bolt    360
6        Spin    805
3        Jump   1210
5        Lyft   1735
4        Lime   1824
0        Bird   3860

In [184]:
spin.sumdid.nunique()

805

In [185]:
spin.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-07-30 17:35:06.990,36.14528,-86.80569,Powered7049691,Powered,92.0,Scooter,0.23,Spin
1,2019-07-30 17:35:06.990,36.16017,-86.77848,Powered8631385,Powered,91.0,Scooter,0.23,Spin
2,2019-07-30 17:35:06.990,36.15249,-86.79480,Powered1741740,Powered,91.0,Scooter,0.23,Spin
3,2019-07-30 17:35:06.990,36.15947,-86.78826,Powered3114843,Powered,78.0,Scooter,0.23,Spin
4,2019-07-30 17:35:06.990,36.16382,-86.77891,Powered8546104,Powered,85.0,Scooter,0.23,Spin

In [186]:
scooters_df['Month'] = scooters_df['pubdatetime'].dt.month

In [187]:
#scooters for May
scooters_may = scooters_df[scooters_df['Month'] == 5]

In [188]:
scooters_may_count = scooters_may[['companyname','sumdid']].groupby(['companyname'])['sumdid'].nunique().reset_index(name='may_count').sort_values(['may_count'])

In [189]:
#scooters for June
scooters_june = scooters_df[scooters_df['Month'] == 6]

In [190]:
scooters_june_count = scooters_june[['companyname','sumdid']].groupby(['companyname'])['sumdid'].nunique().reset_index(name='june_count').sort_values(['june_count'])

In [191]:
#scooters for July
scooters_july = scooters_df[scooters_df['Month'] == 7]

In [192]:
scooters_july_count = scooters_july[['companyname','sumdid']].groupby(['companyname'])['sumdid'].nunique().reset_index(name='july_count').sort_values(['july_count'])

In [193]:
may_june = scooters_may_count.merge(scooters_june_count, how = 'inner', on='companyname')

In [194]:
may_june.head()

  companyname  may_count  june_count
0      Gotcha        223         223
1        Bolt        346         333
2        Spin        687         713
3        Jump        976        1036
4        Lyft       1376        1152

In [195]:
scooter_count_3month = may_june = may_june.merge(scooters_july_count, how = 'inner', on='companyname')

In [196]:
scooter_count_3month

  companyname  may_count  june_count  july_count
0      Gotcha        223         223         224
1        Bolt        346         333         276
2        Spin        687         713         570
3        Jump        976        1036        1206
4        Lyft       1376        1152        1026
5        Lime       1632        1461         903
6        Bird       3064        2910        2583

# Q2 According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:
Removal of staff servicing and test trips.

Removal of trips below one minute.

Trip lengths are capped at 24 hours.

Are the scooter companies in compliance with the second and third part of this rule?

#Are trips below one minute removed?

In [197]:
#define trips under 1 minute.
short_trips = trips_df.query('`tripduration` < 1')

In [198]:
#get count of trips under 1 minute by company.
short_trips[['companyname','sumdid']].groupby(['companyname'])['sumdid'].nunique().reset_index(name = 'count').sort_values(['count'])

  companyname  count
1        Lime    383
0        Bird   1229
2        Lyft   1329

#Are there trips above 24 hours?

In [199]:
trips_over24hours = trips_df.query('`tripduration` > 1440')

In [200]:
trips_over24hours[['companyname','sumdid']].groupby(['companyname'])['sumdid'].nunique().reset_index(name = 'count').sort_values(['count'])

     companyname  count
1           Lyft      2
2           SPIN     28
0  Bolt Mobility    351

# Answer: Lime, Bird, and Lyft all had trips data for under 1 minute. Lyft, Spin, and Bolt all had trips data for over 24 hours.

# Q3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [201]:
trips_df.head()

,pubtimestamp,companyname,triprecordnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlatitude,startlongitude,endlatitude,endlongitude,triproute,create_dt
0,2019-05-01 00:00:55.423,Bird,BRD2134,Powered9EAJL,3.0000,958.00528,2019-05-01,00:00:20.460000,2019-05-01,00:02:52.346666,36.15710,-86.80360,36.15660,-86.80670,"[(36.157235, -86.803612), (36.157235, -86.8036...",2019-05-02 05:30:23.780
1,2019-05-01 00:03:33.147,Lyft,LFT5,Powered296631,1.7156,1371.39112,2019-05-01,00:01:50.090000,2019-05-01,00:03:33.026666,36.15797,-86.77896,36.16054,-86.77689,"[(36.15797, -86.77896), (36.15795, -86.77873),...",2019-05-02 07:20:32.757
2,2019-05-01 00:05:55.570,Bird,BRD2168,Powered7S2UU,3.0000,2296.58800,2019-05-01,00:03:47.363333,2019-05-01,00:07:13.596666,36.15470,-86.78180,36.15650,-86.78680,"[(36.155068, -86.782124), (36.156597, -86.78675)]",2019-05-02 05:30:24.530
3,2019-05-01 00:05:55.570,Bird,BRD2166,PoweredZIIVX,3.0000,1200.78744,2019-05-01,00:04:21.386666,2019-05-01,00:06:59.176666,36.14940,-86.77950,36.15310,-86.77960,"[(36.149741, -86.779344), (36.149741, -86.7793...",2019-05-02 05:30:24.237
4,2019-05-01 00:05:55.570,Bird,BRD2165,PoweredJ7MB3,2.0000,351.04988,2019-05-01,00:04:27.796666,2019-05-01,00:06:23.150000,36.17780,-86.78660,36.17740,-86.78760,"[(36.177699, -86.786477), (36.177711, -86.7864...",2019-05-02 05:30:24.207

In [202]:
sumdid_per_day = trips_df.groupby(['sumdid','startdate']).size().reset_index(name='times_used_per_day')

In [203]:
sumdid_per_day.head()

,sumdid,startdate,times_used_per_day
0,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-24,1
1,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-25,2
2,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-26,7
3,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-27,4
4,Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619,2019-05-29,1

In [204]:
scooters_trips_per_day = sumdid_per_day.groupby('sumdid')['times_used_per_day'].sum().reset_index()

In [205]:
scooters_trips_per_day

                                            sumdid  times_used_per_day
0     Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619                  92
1     Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d                  57
2     Powered-03be23ca-d43b-222f-be54-e44b5b4690df                  81
3     Powered-046201fb-6532-1f37-6334-3612fb1e61f7                  71
4     Powered-0479bb84-afbd-0426-f1c4-df628542a88c                  96
...                                            ...                 ...
9000   Poweredff356f94-2252-5432-b484-ad9679bf4b8d                  11
9001   Poweredff4b01f3-1f3f-5d6b-b1c5-5d6628ffa629                   6
9002   Poweredff8a28ab-0ffb-59ce-9b1e-2d1299a25634                  23
9003   Poweredffcc1b11-af95-5e06-b002-82ffb342aae8                   6
9004                         StandardLIRPOZ7X3ZVGO                   1

[9005 rows x 2 columns]

#get numbers of days each scooter was active from scooters df

In [206]:
scooters_df['day'] = scooters_df['pubdatetime'].dt.day

In [207]:
scooters_df

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname,Month,day
0,2019-07-30 17:37:28.870,36.141562,-86.806655,PoweredVAW9Y,Powered,95.0,scooter,0.15,Bird,7,30
1,2019-07-30 17:37:28.870,36.159744,-86.780067,PoweredSNB79,Powered,58.0,scooter,0.15,Bird,7,30
2,2019-07-30 17:37:28.870,36.153569,-86.784961,PoweredZY5KX,Powered,100.0,scooter,0.15,Bird,7,30
3,2019-07-30 17:37:28.870,36.155984,-86.782756,PoweredPHVAG,Powered,100.0,scooter,0.15,Bird,7,30
4,2019-07-30 17:37:28.870,36.147253,-86.815000,Powered238ZE,Powered,76.0,scooter,0.15,Bird,7,30
...,...,...,...,...,...,...,...,...,...,...,...
5559568,2019-07-30 17:30:06.803,36.153090,-86.783980,Powered8052471,Powered,92.0,Scooter,0.23,Spin,7,30
5559569,2019-07-30 17:30:06.803,36.158640,-86.767830,Powered4853276,Powered,99.0,Scooter,0.23,Spin,7,30
5559570,2019-07-30 17:30:06.803,36.152500,-86.783750,Powered1245835,Powered,96.0,Scooter,0.23,Spin,7,30
5559571,2019-07-30 17:30:06.803,36.158020,-86.783790,Powered7927186,Powered,100.0,Scooter,0.23,Spin,7,30
5559572,2019-07-30 17:30:06.803,36.164380,-86.769250,Powered4053444,Powered,99.0,Scooter,0.23,Spin,7,30

In [240]:
#scooters_count_active = scooters_df.groupby('sumdid')['day'].size().reset_index()
scooters_count_active = scooters_df.groupby(['sumdid','Month','day']).size().reset_index()

In [246]:
scooters_count_active[scooters_count_active['sumdid'] == 'Powered5129907' ]

                sumdid  Month  day    0
118333  Powered5129907      6   17   77
118334  Powered5129907      6   18  195
118335  Powered5129907      6   19  199
118336  Powered5129907      6   20  198
118337  Powered5129907      6   21  139
118338  Powered5129907      6   22  155
118339  Powered5129907      6   23  285
118340  Powered5129907      6   24  205
118341  Powered5129907      6   25  165
118342  Powered5129907      6   26  180
118343  Powered5129907      6   27  200
118344  Powered5129907      6   28  186
118345  Powered5129907      6   29  153
118346  Powered5129907      6   30  175
118347  Powered5129907      7    1  172
118348  Powered5129907      7    2  146
118349  Powered5129907      7    3  171
118350  Powered5129907      7    4  176
118351  Powered5129907      7    5  161
118352  Powered5129907      7    6  157
118353  Powered5129907      7    7  121

In [222]:
scooters_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 73414043 entries, 0 to 5559572
Data columns (total 11 columns):
 #   Column       Dtype
---  ------       -----
 0   pubdatetime  datetime64[ns]
 1   latitude     float64
 2   longitude    float64
 3   sumdid       object
 4   sumdtype     object
 5   chargelevel  float64
 6   sumdgroup    object
 7   costpermin   float64
 8   companyname  object
 9   Month        int32
 10  day          int32
dtypes: datetime64[ns](1), float64(4), int32(2), object(4)
memory usage: 6.0+ GB